def remember(ราคา,เงินจ่าย):
    return "รอรับเงินทอน" if ราคา < เงินจ่าย else("เงินพอดี" if ราคา == เงินจ่าย else("เงินไม่พอกรุณาจ่ายเงินเพิ่ม"))

ผลไม้ = {"แอปเปิ้ล": 50,"มะละกอ:":70 , "กล้วย": 40 , "ส้ม": 80}

while True:
  print("กด1 เพิ่มสินค้า กด2ทำการคำนวน กด3ออก")
  เลือก = input("กรุณากรอกเลข: ")
  

  try:
    เลือกเลข = int(เลือก)

    if เลือกเลข == 1:
     เพิ่มชื่อผลไม้ = input("กรุณากรอกชื่อผลไม้ที่จะเพิ่ม: ")
     ราคาผลไม้ใหม่ = int(input("กรอกราคาผลไม้ใหม่: "))
     ผลไม้[เพิ่มชื่อผลไม้] = ราคาผลไม้ใหม่
     print("เพิ่ม",เพิ่มชื่อผลไม้,"ลงในคลังแล้ว")

    elif เลือกเลข == 2:
     print("*"*20)

     ผลไม้สด = input("กรุณากรอกชื่อผลไม้: ")
     if ผลไม้สด in ผลไม้: 
      ราคาผลไม้ = ผลไม้[ผลไม้สด]
      print(f"ราคาของ {ผลไม้สด} คือ {ราคาผลไม้} บาท")  

      เงิน = int(input("กรุณากรอกเงิน: "))
      ผลลัพธ์ = remember(ราคาผลไม้, เงิน)
      print(ผลลัพธ์)

      if เงิน > ราคาผลไม้:
       เงินทอน = เงิน - ราคาผลไม้
       print("ต้องทอน",เงินทอน)
      else:
       เงินทอน = ราคาผลไม้ - เงิน
       print("ต้องจ่ายอีก",เงินทอน)

    elif เลือกเลข == 3:
            print("ปิดโปรแกรมแล้ว ขอบคุณที่ใช้บริการครับคุณแม่! 🙏")
            break
    else:
            print("โปรดกรอกเฉพาะเลข 1, 2 หรือ 3 เท่านั้นครับ")
   
  except:
   print("กรุณาป้อนอีกที") 
    


